In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as mp


data = pd.read_csv("S02-hw-dataset.csv")
data.head(5)

   user_id   age country  purchases  revenue
0        1  25.0      FR          7      749
1        2  24.0      RU          5     1115
2        3  52.0      FR          7      399
3        4  31.0      RU          6      654
4        5   NaN      DE          6     1296

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   user_id    41 non-null     int64
 1   age        39 non-null     float64
 2   country    41 non-null     object
 3   purchases  41 non-null     int64
 4   revenue    41 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.7+ KB

In [3]:
data.describe()

         user_id         age  purchases      revenue
count  41.000000   39.000000  41.000000    41.000000
mean   20.243902   36.512821   4.829268   820.048780
std    11.659289   18.304259   2.710189   613.127269
min     1.000000    5.000000  -1.000000     0.000000
25%    10.000000   24.000000   3.000000   432.000000
50%    20.000000   33.000000   5.000000   693.000000
75%    30.000000   45.500000   7.000000  1115.000000
max    40.000000  120.000000  11.000000  2475.000000

In [4]:
data.isna()

    user_id    age  country  purchases  revenue
0     False  False    False      False    False
1     False  False    False      False    False
2     False  False    False      False    False
3     False  False    False      False    False
4     False   True    False      False    False
5     False  False    False      False    False
6     False  False    False      False    False
7     False  False    False      False    False
8     False  False    False      False    False
9     False  False    False      False    False
10    False  False    False      False    False
11    False  False    False      False    False
12    False   True    False      False    False
13    False  False    False      False    False
14    False  False    False      False    False
15    False  False    False      False    False
16    False  False    False      False    False
17    False  False    False      False    False
18    False  False    False      False    False
19    False  False    False      False    False
20    False  False    False      False    False
21    False  False    False      False    False
22    False  False    False      False    False
23    False  False    False      False    False
24    False  False    False      False    False
25    False  False    False      False    False
26    False  False    False      False    False
27    False  False    False      False    False
28    False  False    False      False    False
29    False  False    False      False    False
30    False  False    False      False    False
31    False  False    False      False    False
32    False  False    False      False    False
33    False  False    False      False    False
34    False  False    False      False    False
35    False  False    False      False    False
36    False  False    False      False    False
37    False  False    False      False    False
38    False  False    False      False    False
39    False  False    False      False    False
40    False  False    False      False    False

In [5]:
data.isna().mean()

user_id      0.00000
age          0.04878
country      0.00000
purchases    0.00000
revenue      0.00000
dtype: float64

In [6]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40     True
dtype: bool

In [7]:
data.tail(3)

    user_id   age country  purchases  revenue
38       39  39.0      FR          7     1162
39       40  34.0      RU          7     2086
40       10  24.0      RU          7      511

In [8]:
print("Количество ненормальных возрастов: ", data[data["age"] <= 0]["age"].count() + data[data["age"] >= 100]["age"].count())
data[data["age"] >= 100]

Количество ненормальных возрастов:  1

   user_id    age country  purchases  revenue
5        6  120.0      FR         -1      785

In [9]:
print("Количество ненормальных покупок: ", data[data["purchases"] < 0]["purchases"].count())
data[data["purchases"] < 0]

Количество ненормальных покупок:  1

   user_id    age country  purchases  revenue
5        6  120.0      FR         -1      785

In [10]:
anomal_user_id = data.groupby("user_id")
for user_is, ser in anomal_user_id:
    if ser["age"].count() > 1:
        print("Ненормальный user_id: ", user_is)
        print(ser)

Ненормальный user_id:  10
    user_id   age country  purchases  revenue
9        10  24.0      RU          7      511
40       10  24.0      RU          7      511

In [11]:
print("Покупки без зарплаты:\n ", data[(data["revenue"] == 0) & (data["purchases"] > 0)])

Покупки без зарплаты:
      user_id   age country  purchases  revenue
10       11  24.0      US          4        0

**Были обнаружены некоторые аномалии: отрицательные покупки, слишком большой возраст, покупки без зарплаты, дублирующийся user_id**

Также я хочу попробовать фнукцию с ненормальными юзерами оформить еще несколькими способами.

In [12]:
anomal_user_id = data.groupby("user_id").filter(lambda x: x["age"].count() > 1)
anomal_user_id

    user_id   age country  purchases  revenue
9        10  24.0      RU          7      511
40       10  24.0      RU          7      511

In [13]:
new_data = data.copy(deep=True)
new_data["count_of_user_id"] = new_data.groupby("user_id")["age"].transform('count')
new_data[new_data["count_of_user_id"] >= 2]

    user_id   age country  purchases  revenue  count_of_user_id
9        10  24.0      RU          7      511                 2
40       10  24.0      RU          7      511                 2

In [14]:
data.groupby("user_id")["age"].agg(count='count')

         count
user_id
1            1
2            1
3            1
4            1
5            0
6            1
7            1
8            1
9            1
10           2
11           1
12           1
13           0
14           1
15           1
16           1
17           1
18           1
19           1
20           1
21           1
22           1
23           1
24           1
25           1
26           1
27           1
28           1
29           1
30           1
31           1
32           1
33           1
34           1
35           1
36           1
37           1
38           1
39           1
40           1

In [15]:
data

    user_id    age country  purchases  revenue
0         1   25.0      FR          7      749
1         2   24.0      RU          5     1115
2         3   52.0      FR          7      399
3         4   31.0      RU          6      654
4         5    NaN      DE          6     1296
5         6  120.0      FR         -1      785
6         7   46.0      RU          0        0
7         8   28.0      CN          2      456
8         9   39.0      US          4      980
9        10   24.0      RU          7      511
10       11   24.0      US          4        0
11       12   20.0      CN          7     1652
12       13    NaN      US          9      630
13       14   36.0      DE          9     2358
14       15   57.0      FR          7      693
15       16   22.0      FR          3      183
16       17   32.0      FR          6     1608
17       18   24.0      RU          0        0
18       19   47.0      RU          3      432
19       20   31.0      RU          2      442
20       21    5.0      RU          8     1488
21       22   33.0      FR          6      546
22       23   42.0      US          4      904
23       24   32.0      DE         11     2475
24       25   21.0      RU          5      650
25       26   35.0      US          5      330
26       27   54.0      RU          6     1302
27       28   43.0      US          3      828
28       29   47.0      FR          6     1440
29       30   52.0      DE          6      702
30       31   55.0      FR          1      142
31       32   26.0      RU          6     1080
32       33   23.0      US          5      445
33       34   28.0      FR          0        0
34       35   45.0      FR          2      404
35       36   51.0      US          3      342
36       37   18.0      DE          4     1104
37       38   35.0      DE          3      738
38       39   39.0      FR          7     1162
39       40   34.0      RU          7     2086
40       10   24.0      RU          7      511

In [17]:
data["country"].value_counts()

country
RU    13
FR    12
US     8
DE     6
CN     2
Name: count, dtype: int64

In [28]:
data.groupby("country")["revenue"].agg( count='count', median_revenue='median')

         count  median_revenue
country
CN           2          1054.0
DE           6          1200.0
FR          12           619.5
RU          13           650.0
US           8           537.5

**Можно наблюдать, что наименьшая revenue у американцев, что странно, у русских даже больше. Во дела!**